faronov/cc2530-zigbee/tests/test_zcl_dispatch.c
/* SPDX-License-Identifier: BSD-3-Clause
 * Copyright (c) 2026, cc2530-zigbee contributors. See LICENSE.
 */
#include "zcl_dispatch.h"
#include "cc2530_mmio.h"

#include <stddef.h>
#include <string.h>

#define CHECK(condition) do { if (!(condition)) return (uint16_t)__LINE__; } while (0)

static const MCU_CODE uint8_t scalar[] = {0x78, 0x56};
static const MCU_CODE zcl_attribute_t code_attributes[] = {
    {0xffff, 1, {ZCL_TYPE_UINT16, 0, scalar, 2}},
    {0x1234, 0, {ZCL_TYPE_UINT8, 0xff, NULL, 65535}},
    {0x0000, 1, {ZCL_TYPE_NO_DATA, 0, NULL, 0}},
    {0x8000, 1, {ZCL_TYPE_CHARACTER_STRING, 1, NULL, 0}}
};
static const MCU_CODE zcl_attribute_set_t code_set = {code_attributes, 4, 0, 0, 0x5678};
static const MCU_CODE uint8_t code_request[] = {0, 0x5a, 0x0c, 0, 0, 0xff};
static const MCU_CODE uint8_t golden[] = {
    0x18, 0x5a, 0x0d, 1, 0, 0, 0, 0x34, 0x12, 0x20,
    0, 0x80, 0x42, 0xff, 0xff, 0x21
};
static zcl_attribute_t attributes[ZCL_ATTRIBUTE_MAX_COUNT];
static zcl_attribute_set_t set;
static zcl_dispatch_info_t info;
static uint8_t request[102], response[102];

static uint8_t filled(const uint8_t *bytes, uint16_t size, uint8_t value)
{
    while (size--)
        if (*bytes++ != value)
            return 0;
    return 1;
}

static void base(void)
{
    memset(attributes, 0, sizeof(attributes));
    memcpy(attributes, code_attributes, sizeof(code_attributes));
    set = code_set;
    set.attributes = attributes;
    memset(request, 0xee, sizeof(request));
    memcpy(request, code_request, sizeof(code_request));
    memset(response, 0xc7, sizeof(response));
    memset(&info, 0xa5, sizeof(info));
}

static uint16_t failure(uint16_t length, uint16_t capacity, zcl_codec_result_t expected)
{
    memset(response, 0xc7, sizeof(response));
    memset(&info, 0xa5, sizeof(info));
    CHECK(zcl_dispatch_unicast(&set, request, length, response + 1, capacity, &info) == expected);
    CHECK(filled(response, sizeof(response), 0xc7));
    CHECK(filled((const uint8_t *)&info, sizeof(info), 0xa5));
    return 0;
}

static uint16_t golden_cases(void)
{
    volatile uint8_t manufacturer, side, disable, offset;
    base();
    CHECK(zcl_dispatch_unicast(&code_set, code_request, sizeof(code_request), response + 1, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.kind == ZCL_DISPATCH_RESPONSE && info.sequence == 0x5a && info.length == sizeof(golden));
    CHECK(info.command_id == 0x0d && info.requested_count == 255 && info.returned_count == 4 && info.discovery_complete == 1);
    CHECK(info.default_command == 0 && info.default_status == 0 && info.default_raw_status == 0);
    CHECK(memcmp(response + 1, golden, sizeof(golden)) == 0 && response[0] == 0xc7);
    CHECK(filled(response + 1 + info.length, 101u - info.length, 0xc7));
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        for (side = 0; side < 2; side++) {
            for (disable = 0; disable < 2; disable++) {
                base();
                set.manufacturer_specific = manufacturer;
                set.side = side;
                offset = manufacturer ? 5 : 3;
                request[0] = (uint8_t)((manufacturer ? 4u : 0xe0u) | (side ? 8u : 0u) | (disable ? 16u : 0u));
                request[1] = 0x78;
                request[2] = 0x56;
                request[offset - 2u] = 0x5a;
                request[offset - 1u] = 0x0c;
                request[offset] = request[offset + 1u] = 0;
                request[offset + 2u] = 0xff;
                CHECK(zcl_dispatch_unicast(&set, request, (uint16_t)(offset + 3u), response + 1, 100, &info) == ZCL_CODEC_OK);
                CHECK(info.length == offset + 13u && info.returned_count == 4 && info.discovery_complete == 1);
                CHECK(response[1] == (uint8_t)(0x10u | (side ? 0u : 8u) | (manufacturer ? 4u : 0u)));
                if (manufacturer)
                    CHECK(response[2] == 0x78 && response[3] == 0x56);
                CHECK(response[offset - 1u] == 0x5a && response[offset] == 0x0d);
                CHECK(memcmp(response + 1 + offset, golden + 3, 13) == 0);
                CHECK(response[0] == 0xc7 && filled(response + 1 + info.length, 101u - info.length, 0xc7));
            }
        }
    }
    base();
    request[5] = 2;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 10 && info.returned_count == 2 && info.discovery_complete == 0 && response[3] == 0);
    CHECK(memcmp(response + 4, golden + 4, 6) == 0);
    request[3] = 0x35;
    request[4] = 0x12;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 10 && info.returned_count == 2 && info.discovery_complete == 1);
    CHECK(memcmp(response + 4, golden + 10, 6) == 0);
    request[3] = request[4] = 0xff;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 7 && info.returned_count == 1 && info.discovery_complete == 1);
    CHECK(response[4] == 0xff && response[5] == 0xff && response[6] == 0x21);
    request[5] = 0;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 4, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 4 && info.returned_count == 0 && info.discovery_complete == 0);
    set.count = 0;
    set.attributes = NULL;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 4, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 4 && info.discovery_complete == 1 && response[3] == 1);
    return 0;
}

static uint16_t capacity_cases(void)
{
    volatile uint8_t manufacturer, offset, capacity, n, expected;
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        base();
        set.manufacturer_specific = manufacturer;
        offset = manufacturer ? 5 : 3;
        request[0] = manufacturer ? 4 : 0;
        request[1] = 0x78;
        request[2] = 0x56;
        request[offset - 2u] = 0x5a;
        request[offset - 1u] = 0x0c;
        request[offset] = request[offset + 1u] = 0;
        for (n = 0; n <= 5; n++) {
            request[offset + 2u] = n;
            for (capacity = 0; capacity <= 20; capacity++) {
                if (capacity < offset + 1u + (n ? 3u : 0u)) {
                    CHECK(failure((uint16_t)(offset + 3u), capacity, ZCL_CODEC_BUFFER_TOO_SMALL) == 0);
                    continue;
                }
                memset(response, 0xc7, sizeof(response));
                CHECK(zcl_dispatch_unicast(&set, request, (uint16_t)(offset + 3u), response + 1, capacity, &info) == ZCL_CODEC_OK);
                expected = (uint8_t)((capacity - offset - 1u) / 3u);
                if (expected > n) expected = n;
                if (expected > 4u) expected = 4;
                CHECK(info.returned_count == expected && info.length == offset + 1u + 3u * expected);
                CHECK(info.requested_count == n && info.discovery_complete == (expected == 4u));
                CHECK(response[offset + 1u] == info.discovery_complete);
                CHECK(memcmp(response + offset + 2u, golden + 4, 3u * expected) == 0);
                CHECK(response[0] == 0xc7 && filled(response + 1 + info.length, 101u - info.length, 0xc7));
            }
        }
    }
    return 0;
}

