faronov/cc2530-zigbee/tests/test_zcl_dispatch.c
static uint16_t dispatch_cases(void)
{
    uint8_t length, i;
    base();
    request[2] = 0;
    request[3] = request[4] = 0xff;
    CHECK(zcl_dispatch_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.command_id == 1 && info.length == 9 && info.requested_count == 1 && info.returned_count == 1);
    CHECK(response[0] == 0x18 && response[1] == 0x5a && response[2] == 1 && response[5] == 0);
    CHECK(response[6] == 0x21 && response[7] == 0x78 && response[8] == 0x56);
    request[3] = 0x34;
    request[4] = 0x12;
    CHECK(zcl_dispatch_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 6 && response[5] == 0x7e);
    for (i = 0; i < 2; i++) {
        request[0] = i ? 0x10 : 0;
        request[2] = 0x0c;
        for (length = 3; length < 6; length++) {
            CHECK(failure(length, 4, ZCL_CODEC_BUFFER_TOO_SMALL) == 0);
            CHECK(zcl_dispatch_unicast(&set, request, length, response, 5, &info) == ZCL_CODEC_OK);
            CHECK(info.length == 5 && info.command_id == 0x0b && info.default_command == 0x0c);
            CHECK(info.default_status == 0x80 && info.default_raw_status == 0x80);
            CHECK(response[0] == 0x18 && response[2] == 0x0b && response[3] == 0x0c && response[4] == 0x80);
        }
        request[2] = 0;
        CHECK(zcl_dispatch_unicast(&set, request, 4, response, 5, &info) == ZCL_CODEC_OK);
        CHECK(info.command_id == 0x0b && info.default_command == 0 && info.default_status == 0x80);
        request[2] = 0x02;
        CHECK(zcl_dispatch_unicast(&set, request, 6, response, 5, &info) == ZCL_CODEC_OK);
        CHECK(info.command_id == 0x0b && info.default_command == 2 && info.default_status == 0x81);
        CHECK(response[3] == 2 && response[4] == 0x81);
        request[2] = 5;
        CHECK(failure(3, 0, ZCL_CODEC_UNSUPPORTED_NO_RESPONSE) == 0);
        CHECK(failure(100, 100, ZCL_CODEC_UNSUPPORTED_NO_RESPONSE) == 0);
        request[2] = 0x0b;
        CHECK(failure(3, 100, ZCL_CODEC_TRUNCATED) == 0);
        CHECK(failure(4, 100, ZCL_CODEC_TRUNCATED) == 0);
        request[3] = 0x02;
        request[4] = 0x8f;
        CHECK(zcl_dispatch_unicast(&set, request, 5, response, 0, &info) == ZCL_CODEC_OK);
        CHECK(info.kind == ZCL_DISPATCH_DEFAULT_RECEIVED && info.length == 0 && info.sequence == 0x5a);
        CHECK(info.command_id == 0x0b && info.default_command == 2 && info.default_raw_status == 0x8f && info.default_status == 0x7e);
        CHECK(filled(response, sizeof(response), 0xc7));
        CHECK(zcl_dispatch_unicast(&set, request, 100, response, 0, &info) == ZCL_CODEC_OK);
        CHECK(info.kind == ZCL_DISPATCH_DEFAULT_RECEIVED && info.default_status == 0x7e);
        request[0] |= 1u;
        CHECK(zcl_dispatch_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(info.kind == ZCL_DISPATCH_RESPONSE && info.default_command == 0x0b && info.default_status == 0x81);
        request[2] = 5;
        CHECK(zcl_dispatch_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(info.kind == ZCL_DISPATCH_RESPONSE && info.default_command == 5 && info.default_status == 0x81);
    }
    base();
    CHECK(zcl_dispatch_unicast(&set, request, 100, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == sizeof(golden) && memcmp(response, golden, sizeof(golden)) == 0);
    request[0] = 4;
    request[1] = 0x78;
    request[2] = 0x56;
    request[3] = 0x5a;
    request[4] = 0x0c;
    request[5] = request[6] = 0;
    request[7] = 255;
    CHECK(zcl_dispatch_unicast(&set, request, 8, response, 7, &info) == ZCL_CODEC_OK);
    CHECK(info.default_status == 0x81 && response[0] == 0x1c && response[1] == 0x78 && response[2] == 0x56);
    CHECK(response[3] == 0x5a && response[4] == 0x0b && response[5] == 0x0c && response[6] == 0x81);
    request[4] = 5;
    CHECK(failure(8, 100, ZCL_CODEC_UNSUPPORTED_NO_RESPONSE) == 0);
    request[4] = 0x0b;
    CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    set.manufacturer_specific = 1;
    request[5] = 0;
    request[6] = 0x82;
    CHECK(zcl_dispatch_unicast(&set, request, 7, response, 0, &info) == ZCL_CODEC_OK);
    CHECK(info.kind == ZCL_DISPATCH_DEFAULT_RECEIVED && info.default_status == 0x81);
    CHECK(failure(8, 100, ZCL_CODEC_UNSUPPORTED_LAYOUT) == 0);
    request[4] = 0x0c;
    request[5] = request[6] = 0;
    CHECK(failure(9, 100, ZCL_CODEC_UNSUPPORTED_LAYOUT) == 0);
    set.manufacturer_code ^= 1u;
    CHECK(zcl_dispatch_unicast(&set, request, 8, response, 7, &info) == ZCL_CODEC_OK);
    CHECK(info.default_status == 0x81 && response[1] == 0x78 && response[2] == 0x56);
    return 0;
}

static uint16_t model_cases(void)
{
    uint8_t i;
    base();
    attributes[1].id = attributes[0].id;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    attributes[0].readable = 2;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    set.side = 2;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    set.side = 0;
    request[0] = 8;
    CHECK(failure(6, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    base();
    set.manufacturer_specific = 2;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    set.count = 17;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    set.count = 1;
    set.attributes = NULL;
    CHECK(failure(6, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    attributes[1].value.type = 0xff;
    CHECK(failure(6, 100, ZCL_CODEC_UNSUPPORTED_DATA_TYPE) == 0);
    request[5] = 1;
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 7, &info) == ZCL_CODEC_OK);
    CHECK(info.returned_count == 1 && info.discovery_complete == 0);
    request[2] = 0;
    request[3] = 0xff;
    request[4] = 0xff;
    attributes[0].value.data = NULL;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_ARGUMENT) == 0);
    base();
    set.count = 16;
    for (i = 0; i < set.count; i++) {
        attributes[i].id = (uint16_t)(0xfff0u + (15u - i));
        attributes[i].readable = 0;
        attributes[i].value.type = ZCL_TYPE_UINT8;
    }
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 52 && info.returned_count == 16 && info.discovery_complete == 1);
    for (i = 0; i < set.count; i++)
        CHECK(response[4u + 3u * i] == 0xf0u + i && response[5u + 3u * i] == 0xff && response[6u + 3u * i] == 0x20);
    CHECK(attributes[0].id == 0xffff && attributes[15].id == 0xfff0);
    base();
    for (i = 0; i < 3; i++)
        CHECK(failure(i, 100, ZCL_CODEC_TRUNCATED) == 0);
    CHECK(failure(101, 100, ZCL_CODEC_TOO_LONG) == 0);
    request[0] = 2;
    CHECK(failure(6, 100, ZCL_CODEC_UNSUPPORTED_FRAME_TYPE) == 0);
    request[0] = 0xe4;
    CHECK(failure(6, 100, ZCL_CODEC_UNSUPPORTED_LAYOUT) == 0);
    CHECK(zcl_attr_set_check(NULL) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_dispatch_unicast(NULL, request, 6, response, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_dispatch_unicast(&set, NULL, 6, response, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_dispatch_unicast(&set, request, 6, NULL, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, NULL) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)&info, sizeof(info), 0xa5));
    return 0;
}

static uint16_t run_tests(void)
{
    uint16_t result = golden_cases();
    if (result == 0) result = capacity_cases();
    if (result == 0) result = dispatch_cases();
    if (result == 0) result = model_cases();
    return result;
}

#ifndef CC2530_HOST_TEST
volatile MCU_XDATA MCU_AT(0x1e00) uint8_t zcl_dispatch_test_result[8];

void main(void)
{
    uint16_t result = run_tests();
    zcl_dispatch_test_result[0] = 'Z';
    zcl_dispatch_test_result[1] = 'C';
    zcl_dispatch_test_result[2] = 'D';
    zcl_dispatch_test_result[3] = '1';
    zcl_dispatch_test_result[4] = 1;
    zcl_dispatch_test_result[5] = 8;
    zcl_dispatch_test_result[6] = (uint8_t)result;
    zcl_dispatch_test_result[7] = (uint8_t)(result >> 8);
    __asm
        .globl _zcl_dispatch_test_done
    _zcl_dispatch_test_done:
        nop
    __endasm;
    for (;;) {}
}
#else
#include <stdio.h>
#include <stdlib.h>

static uint16_t exhaustive_cases(void)
{
    uint32_t n;
    unsigned maximum, capacity, count, i, expected, used, status, manufacturer, command, control;
    uint16_t start;
    uint8_t *input, *output;
    zcl_dispatch_info_t *result;
    zcl_attribute_t *table;
    size_t bytes;
    zcl_codec_result_t rc;
    base();
    for (n = 0; n <= 65535UL; n++) {
        request[3] = (uint8_t)n;
        request[4] = (uint8_t)(n >> 8);
        CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
        expected = 0;
        for (i = 0; i < 4; i++) {
            start = (uint16_t)((uint16_t)golden[4u + i * 3u] | ((uint16_t)golden[5u + i * 3u] << 8));
            if (start >= n) {
                CHECK(memcmp(response + 4 + expected * 3, golden + 4 + i * 3, 3) == 0);
                expected++;
            }
        }
        CHECK(info.discovery_complete == 1 && info.returned_count == expected && info.length == 4u + 3u * expected);
    }
    for (count = 0; count <= 16; count++) {
        base();
        bytes = count ? count * sizeof(*table) : 1u;
        table = malloc(bytes);
        CHECK(table != NULL);
        memset(table, 0, bytes);
        for (i = 0; i < count; i++) {
            table[i].id = (uint16_t)(count - 1u - i);
            table[i].value.type = ZCL_TYPE_NO_DATA;
        }
        set.attributes = table;
        set.count = (uint8_t)count;
        for (maximum = 0; maximum < 256; maximum++) {
            request[5] = (uint8_t)maximum;
            for (capacity = 0; capacity <= 102; capacity++) {
                memset(response, 0xc7, sizeof(response));
                memset(&info, 0xa5, sizeof(info));
                rc = zcl_dispatch_unicast(&set, request, 6, response, (uint16_t)capacity, &info);
                if (capacity < 4 || (capacity < 7 && maximum && count)) {
                    CHECK(rc == ZCL_CODEC_BUFFER_TOO_SMALL);
                    CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)&info, sizeof(info), 0xa5));
                } else {
                    expected = ((capacity > 100 ? 100u : capacity) - 4u) / 3u;
                    if (expected > maximum) expected = maximum;
                    if (expected > count) expected = count;
                    CHECK(rc == ZCL_CODEC_OK && info.returned_count == expected);
                    CHECK(info.length == 4u + 3u * expected && info.discovery_complete == (expected == count));
                    for (i = 0; i < expected; i++)
                        CHECK(response[4u + i * 3u] == i && response[5u + i * 3u] == 0 && response[6u + i * 3u] == 0);
                    CHECK(filled(response + info.length, (uint16_t)(sizeof(response) - info.length), 0xc7));
                }
            }
        }
        free(table);
    }
    base();
    for (control = 0; control < 256; control++) {
        request[0] = (uint8_t)control;
        set.side = (uint8_t)((control >> 3) & 1u);
        set.manufacturer_specific = (uint8_t)((control >> 2) & 1u);
        used = set.manufacturer_specific ? 5u : 3u;
        request[1] = 0x78;
        request[2] = 0x56;
        request[used - 2u] = 0x5a;
        request[used] = request[used + 1u] = 0;
        request[used + 2u] = 255;
        for (command = 0; command < 256; command++) {
            request[used - 1u] = (uint8_t)command;
            memset(response, 0xc7, sizeof(response));
            memset(&info, 0xa5, sizeof(info));
            rc = zcl_dispatch_unicast(&set, request, (uint16_t)(used + (command == 0x0b ? 2u : 3u)), response, 100, &info);
            if ((control & 3u) > 1u || (control & 4u && control & 0xe0u)) {
                CHECK(rc != ZCL_CODEC_OK && filled(response, sizeof(response), 0xc7));
                CHECK(filled((const uint8_t *)&info, sizeof(info), 0xa5));
            } else if ((control & 3u) == 0 && command == 5) {
                CHECK(rc == ZCL_CODEC_UNSUPPORTED_NO_RESPONSE && filled(response, sizeof(response), 0xc7));
                CHECK(filled((const uint8_t *)&info, sizeof(info), 0xa5));
            } else {
                CHECK(rc == ZCL_CODEC_OK);
                if ((control & 3u) == 0 && command == 0x0b) {
                    CHECK(info.kind == ZCL_DISPATCH_DEFAULT_RECEIVED && info.length == 0 && filled(response, sizeof(response), 0xc7));
                } else {
                    CHECK(info.kind == ZCL_DISPATCH_RESPONSE && response[0] == (((control & 0x1cu) ^ 8u) | 0x10u));
                    CHECK(response[used - 2u] == 0x5a && response[used - 1u] == info.command_id);
                    if ((control & 3u) == 0 && command == 0x0c) {
                        CHECK(info.command_id == 0x0d && info.discovery_complete == 1 && info.returned_count == 4);
                    } else {
                        CHECK(info.command_id == 0x0b && info.default_command == command);
                        CHECK(info.default_status == ((control & 3u) == 0 && command == 0 ? 0x80u : 0x81u));
                    }
                }
            }
        }
    }
    base();
    request[2] = 0x0b;
    for (n = 0; n < 256; n++) {
        request[3] = (uint8_t)n;
        for (status = 0; status < 256; status++) {
            request[4] = (uint8_t)status;
            expected = status;
            switch (status) {
            case 0x82: case 0x83: case 0x84: expected = 0x81; break;
            case 0x8a: case 0xc4: expected = 0; break;
            case 0x8f: expected = 0x7e; break;
            case 0x90: case 0x91: case 0x93: case 0xc0: case 0xc1: expected = 1; break;
            }
            CHECK(zcl_dispatch_unicast(&set, request, 5, response, 0, &info) == ZCL_CODEC_OK);
            CHECK(info.kind == ZCL_DISPATCH_DEFAULT_RECEIVED && info.default_command == n && info.default_status == expected);
            CHECK(info.default_raw_status == status && info.length == 0 && filled(response, sizeof(response), 0xc7));
        }
    }
    for (n = 0; n < 256; n++) {
        base();
        set.count = 1;
        attributes[0].id = 0;
        attributes[0].readable = 0;
        attributes[0].value.data = NULL;
        attributes[0].value.data_length = 65535;
        attributes[0].value.type = (uint8_t)n;
        expected = n == 0 || (n >= 8 && n <= 16) || (n >= 0x18 && n <= 0x31) || n == 0x41 || n == 0x42;
        CHECK(zcl_value_type_supported((uint8_t)n) == expected);
        if (expected) {
            CHECK(zcl_dispatch_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
            CHECK(info.length == 7 && response[6] == n);
        } else {
            CHECK(failure(6, 100, ZCL_CODEC_UNSUPPORTED_DATA_TYPE) == 0);
        }
    }
    result = malloc(sizeof(*result));
    CHECK(result != NULL);
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        base();
        set.manufacturer_specific = (uint8_t)manufacturer;
        used = manufacturer ? 5u : 3u;
        request[0] = manufacturer ? 4 : 0;
        request[1] = 0x78;
        request[2] = 0x56;
        request[used - 2u] = 0x5a;
        request[used - 1u] = 0x0c;
        request[used] = request[used + 1u] = 0;
        request[used + 2u] = 255;
        for (n = 0; n <= 101; n++) {
            input = malloc(n ? n : 1u);
            CHECK(input != NULL);
            memcpy(input, request, n);
            for (capacity = 0; capacity <= 102; capacity++) {
                output = malloc(capacity ? capacity : 1u);
                CHECK(output != NULL);
                memset(output, 0xc7, capacity);
                memset(result, 0xa5, sizeof(*result));
                rc = zcl_dispatch_unicast(&set, input, (uint16_t)n, output, (uint16_t)capacity, result);
                if (n > 100) CHECK(rc == ZCL_CODEC_TOO_LONG);
                else if (n < used) CHECK(rc == ZCL_CODEC_TRUNCATED);
                else if (n < used + 3u) CHECK(rc == (capacity < used + 2u ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK));
                else if (manufacturer && n > used + 3u) CHECK(rc == ZCL_CODEC_UNSUPPORTED_LAYOUT);
                else CHECK(rc == (capacity < used + 4u ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK));
                if (rc != ZCL_CODEC_OK) {
                    CHECK(filled(output, (uint16_t)capacity, 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
                } else {
                    CHECK(result->kind == ZCL_DISPATCH_RESPONSE && result->length <= capacity);
                    CHECK(filled(output + result->length, (uint16_t)(capacity - result->length), 0xc7));
                }
                CHECK(memcmp(input, request, n) == 0);
                free(output);
            }
            free(input);
        }
    }
    free(result);
    return 0;
}

