faronov/cc2530-zigbee/tests/test_zcl_dispatch.c
static uint16_t wide_spans_and_context(void)
{
    uint8_t *input, *output;
    zcl_dispatch_info_t *result;
    uint32_t n;
    unsigned capacity;
    zcl_codec_result_t expected;
    base();
    input = malloc(65535);
    output = malloc(65535);
    result = malloc(sizeof(*result));
    CHECK(input != NULL && output != NULL && result != NULL);
    memset(input, 0xee, 65535);
    memset(output, 0xc7, 65535);
    memcpy(input, code_request, 6);
    for (n = 0; n <= 65535UL; n++) {
        memset(result, 0xa5, sizeof(*result));
        memset(response, 0xc7, sizeof(response));
        expected = n > 100 ? ZCL_CODEC_TOO_LONG : n < 3 ? ZCL_CODEC_TRUNCATED : ZCL_CODEC_OK;
        CHECK(zcl_dispatch_unicast(&set, input, (uint16_t)n, response, 100, result) == expected);
        if (expected != ZCL_CODEC_OK) {
            CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
        } else {
            CHECK(result->command_id == (n < 6 ? 0x0bu : 0x0du));
        }
        memset(output, 0xc7, 20);
        memset(result, 0xa5, sizeof(*result));
        expected = n < 7 ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
        CHECK(zcl_dispatch_unicast(&set, input, 6, output, (uint16_t)n, result) == expected);
        if (expected == ZCL_CODEC_OK) {
            capacity = ((n > 100 ? 100u : n) - 4u) / 3u;
            if (capacity > 4) capacity = 4;
            CHECK(result->length == 4u + 3u * capacity && result->returned_count == capacity);
            CHECK(result->discovery_complete == (capacity == 4));
            CHECK(filled(output + result->length, (uint16_t)(20u - result->length), 0xc7));
        } else {
            CHECK(filled(output, 20, 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
        }
    }
    CHECK(filled(output + 20, 65515, 0xc7));
    free(input);
    free(output);
    free(result);
    base();
    set.manufacturer_specific = 1;
    request[0] = 4;
    request[3] = 0x5a;
    request[4] = 0x0c;
    request[5] = request[6] = 0;
    request[7] = 1;
    for (n = 0; n <= 65535UL; n++) {
        set.manufacturer_code = (uint16_t)n;
        request[1] = (uint8_t)n;
        request[2] = (uint8_t)(n >> 8);
        request[3] = (uint8_t)n;
        CHECK(zcl_dispatch_unicast(&set, request, 8, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(info.command_id == 0x0d && info.sequence == (uint8_t)n && info.returned_count == 1 && info.discovery_complete == 0);
        CHECK(response[1] == request[1] && response[2] == request[2] && response[3] == request[3]);
        set.manufacturer_code ^= 1u;
        CHECK(zcl_dispatch_unicast(&set, request, 8, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(info.command_id == 0x0b && info.default_status == 0x81);
        CHECK(response[1] == request[1] && response[2] == request[2] && response[3] == request[3]);
    }
    return 0;
}

int main(void)
{
    uint16_t result = run_tests();
    if (result == 0) result = exhaustive_cases();
    if (result == 0) result = wide_spans_and_context();
    if (result != 0) {
        fprintf(stderr, "ZCL dispatch test failed at C source line %u\n", result);
        return 1;
    }
    puts("ZCL dispatch: discovery/read/default responses, ordered pages and exact host boundaries PASS.");
    return 0;
}
#endif
